<details>
<summary>Execution result of "plan" in "./environments/dev"</summary>

```terraform
21:19:50.543 INFO   Downloading Terraform configurations from file:///github/workspace/modules/ec2 into /github/workspace/environments/dev/.terragrunt-cache/hz1tUuOgusHYnBndMg9NRm_LfTk/QfoN1PMnAytPab4g4fOyLFMjTX4
21:19:50.564 STDOUT terraform: Initializing the backend...
21:19:50.565 STDOUT terraform: Initializing provider plugins...
21:19:50.565 STDOUT terraform: - Finding latest version of hashicorp/aws...
21:19:50.891 STDOUT terraform: - Installing hashicorp/aws v5.97.0...
21:19:55.135 STDOUT terraform: - Installed hashicorp/aws v5.97.0 (signed by HashiCorp)
21:19:55.135 STDOUT terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
21:19:55.135 STDOUT terraform: selections it made above. Include this file in your version control repository
21:19:55.135 STDOUT terraform: so that Terraform can guarantee to make the same selections by default when
21:19:55.135 STDOUT terraform: you run "terraform init" in the future.
21:19:55.135 STDOUT terraform: Terraform has been successfully initialized!
21:19:57.445 STDOUT terraform: Terraform used the selected providers to generate the following execution
21:19:57.445 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
21:19:57.445 STDOUT terraform:   + create
21:19:57.445 STDOUT terraform: Terraform will perform the following actions:
21:19:57.446 STDOUT terraform:   # aws_instance.terragrunt_instance will be created
21:19:57.446 STDOUT terraform:   + resource "aws_instance" "terragrunt_instance" {
21:19:57.446 STDOUT terraform:       + ami                                  = "ami-0f88e80871fd81e91"
21:19:57.446 STDOUT terraform:       + arn                                  = (known after apply)
21:19:57.446 STDOUT terraform:       + associate_public_ip_address          = (known after apply)
21:19:57.446 STDOUT terraform:       + availability_zone                    = (known after apply)
21:19:57.446 STDOUT terraform:       + cpu_core_count                       = (known after apply)
21:19:57.446 STDOUT terraform:       + cpu_threads_per_core                 = (known after apply)
21:19:57.446 STDOUT terraform:       + disable_api_stop                     = (known after apply)
21:19:57.446 STDOUT terraform:       + disable_api_termination              = (known after apply)
21:19:57.446 STDOUT terraform:       + ebs_optimized                        = (known after apply)
21:19:57.446 STDOUT terraform:       + enable_primary_ipv6                  = (known after apply)
21:19:57.446 STDOUT terraform:       + get_password_data                    = false
21:19:57.446 STDOUT terraform:       + host_id                              = (known after apply)
21:19:57.446 STDOUT terraform:       + host_resource_group_arn              = (known after apply)
21:19:57.446 STDOUT terraform:       + iam_instance_profile                 = (known after apply)
21:19:57.446 STDOUT terraform:       + id                                   = (known after apply)
21:19:57.446 STDOUT terraform:       + instance_initiated_shutdown_behavior = (known after apply)
21:19:57.446 STDOUT terraform:       + instance_lifecycle                   = (known after apply)
21:19:57.446 STDOUT terraform:       + instance_state                       = (known after apply)
21:19:57.446 STDOUT terraform:       + instance_type                        = "t2.micro"
21:19:57.446 STDOUT terraform:       + ipv6_address_count                   = (known after apply)
21:19:57.446 STDOUT terraform:       + ipv6_addresses                       = (known after apply)
21:19:57.446 STDOUT terraform:       + key_name                             = (known after apply)
21:19:57.446 STDOUT terraform:       + monitoring                           = (known after apply)
21:19:57.446 STDOUT terraform:       + outpost_arn                          = (known after apply)
21:19:57.446 STDOUT terraform:       + password_data                        = (known after apply)
21:19:57.446 STDOUT terraform:       + placement_group                      = (known after apply)
21:19:57.446 STDOUT terraform:       + placement_partition_number           = (known after apply)
21:19:57.446 STDOUT terraform:       + primary_network_interface_id         = (known after apply)
21:19:57.446 STDOUT terraform:       + private_dns                          = (known after apply)
21:19:57.446 STDOUT terraform:       + private_ip                           = (known after apply)
21:19:57.446 STDOUT terraform:       + public_dns                           = (known after apply)
21:19:57.446 STDOUT terraform:       + public_ip                            = (known after apply)
21:19:57.446 STDOUT terraform:       + secondary_private_ips                = (known after apply)
21:19:57.446 STDOUT terraform:       + security_groups                      = (known after apply)
21:19:57.446 STDOUT terraform:       + source_dest_check                    = true
21:19:57.446 STDOUT terraform:       + spot_instance_request_id             = (known after apply)
21:19:57.446 STDOUT terraform:       + subnet_id                            = (known after apply)
21:19:57.446 STDOUT terraform:       + tags                                 = {
21:19:57.446 STDOUT terraform:           + "Name" = "terragrunt_instance"
21:19:57.446 STDOUT terraform:         }
21:19:57.446 STDOUT terraform:       + tags_all                             = {
21:19:57.446 STDOUT terraform:           + "Name" = "terragrunt_instance"
21:19:57.446 STDOUT terraform:         }
21:19:57.446 STDOUT terraform:       + tenancy                              = (known after apply)
21:19:57.446 STDOUT terraform:       + user_data                            = (known after apply)
21:19:57.446 STDOUT terraform:       + user_data_base64                     = (known after apply)
21:19:57.446 STDOUT terraform:       + user_data_replace_on_change          = false
21:19:57.446 STDOUT terraform:       + vpc_security_group_ids               = (known after apply)
21:19:57.446 STDOUT terraform:       + capacity_reservation_specification (known after apply)
21:19:57.446 STDOUT terraform:       + cpu_options (known after apply)
21:19:57.446 STDOUT terraform:       + ebs_block_device (known after apply)
21:19:57.446 STDOUT terraform:       + enclave_options (known after apply)
21:19:57.446 STDOUT terraform:       + ephemeral_block_device (known after apply)
21:19:57.446 STDOUT terraform:       + instance_market_options (known after apply)
21:19:57.446 STDOUT terraform:       + maintenance_options (known after apply)
21:19:57.446 STDOUT terraform:       + metadata_options (known after apply)
21:19:57.446 STDOUT terraform:       + network_interface (known after apply)
21:19:57.446 STDOUT terraform:       + private_dns_name_options (known after apply)
21:19:57.446 STDOUT terraform:       + root_block_device (known after apply)
21:19:57.446 STDOUT terraform:     }
21:19:57.446 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
21:19:57.446 STDOUT terraform: 
21:19:57.446 STDOUT terraform: Changes to Outputs:
21:19:57.446 STDOUT terraform:   + public_ip = (known after apply)
```

</details>
    
